

# 1 Написати алгоритм сортування методом швидкого сортування. Елемент розбиття
# вибирати довільно.



# 2 Написати програму, яка в посортованому списку знайде пару елементів сума яких
# буде найблищою до заданого числа n. Наприклад: [4,18,30,44,57], n = 65, пара (18,
# 44)


# 3 Задано список цифр (0-9) довільної довжини. Знайти найменшу суму двох чисел які
# сформовані з списку цифр. Наприклад: [4, 3, 8, 6, 1] сума - 184 (148 + 36)

# 4 Розібрати алгоритм сортування пірамідою та написати програму яка сортує список
# чисел методом піраміди.

